const PHOTO_COUNT = 25;
const AVATAR_COUNT = 6;
const MAX_COMMENT_COUNT = 5;
const MIN_LIKE_COUNT = 15;
const MAX_LIKE_COUNT = 200;

const DESCRIPTIONS = [
  'Я на курорте в Геленджике! И всё благодаря упорному труду #добьюсьцели #отдых',
  'Дорога на пляж ещё никогда не была такой пугающей! 😱😱😱',
  'Мооооорюшко-моооооре...',
  'Со своей женой в Сочи. Репортаж с места событий)',
  'Карри сынаМаминойПодруги 🍜',
  'Купил эту малыху у перекупа. Круто заводится! Только не пойму, почему крыша на ощупь напоминает картон... 🤔',
  '#cтолномер5',
  'Хорошо летом. А у бабушки ещё лучше!',
  'Разведка докладывает: "море чистое!"',
  'Наконец избавился от старой обуви. Наводим красоту)',
  'Le vent se lève!.. Il faut tenter de vivre!',
  'Меня всегда манил белый цвет...',
  'Вкусно кушаю',
  'Не ешь... Подумой!',
  'Товар дня, купить без шума, сланцы, обувь, торговать даром #aliexpress #sell #blackfriday',
  'Жди меня',
  'Хор зайчиков #2024',
  'Обновляем интерьер в офисе #fashion',
  'ШОК!! Фонарик от подкроватного монстра теперь в тренде!',
  'Мама, наконец долетела до лучшей жизни! *Это Казахстан*',
  'Начинаю правильно питаться. Чтобы не отлынивать, буду вести блог и подсчитывать калории каждый день. Поддержите активностью!',
  'И почему я никогда здесь не был...?',
  'LETS DANCE CRAB RAVE!',
  'На треугольнике Иллюминатов множество черных точек. Три точки в этом образовании: ... называются эллипсом. Ellipse звучит как eclipse. Все астрономы - иллюминаты. Вот и думайте головой',
  'Господи! Я так испугалась 😂😱'
];

const MESSAGES = [
  'Всё отлично!',
  'Мега фото! Просто обалдеть. Как вам так удалось?',
  'Да это фоташоп!!!!!!!!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const NAMES = ['Артём', 'Иван', 'Ольга', 'Никита', 'Мария', 'Алексей', 'Анна', 'Дмитрий', 'Екатерина', 'Сергей'];


export { PHOTO_COUNT, AVATAR_COUNT, MAX_COMMENT_COUNT, MIN_LIKE_COUNT, MAX_LIKE_COUNT, DESCRIPTIONS, MESSAGES, NAMES };
